# -*- Mode: org -*-
# -*- coding: utf-8 -*-
#+STARTUP: overview indent inlineimages logdrawer hidestars
#+TITLE:       Research Journal
#+AUTHOR:      Thomas Rushton
#+LANGUAGE:    en
#+TAGS: noexport(n) MEETING(m) SUPERVISION(V) PRESENTATION(p) BLOG(b) TRAINING(T)
#+TAGS: INSPO(i) DIY(d) TEACHING(t) REPRES(R) REVIEW(v) GSoC(G) CONFERENCE(C)
#+TAGS: WRITING(w) BRAINDUMP(B)
#+TAGS: [ PROGRAMMING : R(r) PYTHON(P) JULIA(j) FAUST(f) CPP(c) ]
#+TAGS: [ TOOLS : EMACS(e) ORGMODE(o) GIT(g) ZOTERO(z) LATEX(l) ]
#+TAGS: [ AUDIO : SYNTHESIS(s) PHYSMOD(y) SPATIALAUDIO(S) NETWORKEDAUDIO(N) DDSP(D) ]
#+TAGS: [ HARDWARE : RPI(R) TEENSY(Y) PTP ]
#+EXPORT_SELECT_TAGS: BLOG
#+OPTIONS:   H:3 num:0 toc:t \n:nil @:t ::t |:t ^:{} _:{} -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:nil skip:nil d:nil todo:t pri:nil tags:not-in-toc html-style:nil
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+COLUMNS: %25ITEM %TODO %3PRIORITY %TAGS
#+SEQ_TODO: TODO(t) STARTED(s!) WAITING(w@) APPT(a!) | DONE(d!) CANCELLED(x!) DEFERRED(f!)
#+SEQ_TODO: UNREAD(u) | READ(r) | REVIEWED(v)
#+BIBLIOGRAPHY: references.bib

# HTML Export styles/scripts for theme 'readtheorg'
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
#+HTML_HEAD: <script src="https://ajax.googleapis.com/ajax/libs/jquery/2.1.3/jquery.min.js"></script>
#+HTML_HEAD: <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.4/js/bootstrap.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/lib/js/jquery.stickytableheaders.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/readtheorg/js/readtheorg.js"></script>

***** Org-mode Babel (for literate programming)
  - =<s + tab= template for source bloc. You can easily adapt it to get
    this:
    #+BEGIN_EXAMPLE
      #+begin_src shell
      ls
      #+end_src
    #+END_EXAMPLE
    Now if you =C-c C-c=, it will execute the block.
    #+BEGIN_EXAMPLE
  #+RESULTS:
  | #journal.org# |
  | journal.html  |
  | journal.org   |
  | journal.org~  |
    #+END_EXAMPLE
  
  - Source blocks have many options (formatting, arguments, names,
    sessions,...), which is why I have my own shortcuts =<b + tab= bash
    block (or =B= for sessions).
    #+BEGIN_EXAMPLE 
  #+begin_src shell :results output :exports both
  ls /tmp/*201*.pdf
  #+end_src

  #+RESULTS:
  : /tmp/2015_02_bordeaux_otl_tutorial.pdf
  : /tmp/2015-ASPLOS.pdf
  : /tmp/2015-Europar-Threadmap.pdf
  : /tmp/europar2016-1.pdf
  : /tmp/europar2016.pdf
  : /tmp/M2-PDES-planning-examens-janvier2016.pdf
    #+END_EXAMPLE
  - I have defined many such templates in my configuration. You can
    give a try to =<r=, =<R=, =<RR=, =<g=, =<p=, =<P=, =<m= ...
  - Some of these templates are not specific to babel: e.g., =<h=, =<l=,
    =<L=, =<c=, =<e=, ...
**** Teensy: PTP and PLL4                                     :PTP:TEENSY:
Hard-coding a value for ~CCM_ANALOG_PLL_AUDIO_NUM~ for the clock
follower, I've managed to reduce drift to something on the order of
less than 1 ppm. It turns out that the values for that and
~CCM_ANALOG_PLL_AUDIO_DENOM~ used in ~AudioOutputI2S::config_i2s~
don't (need to) use the full depth of precision afforded by those
registers.

For the default 44.1 kHz sample rate,
~CCM_ANALOG_PLL_AUDIO.DIV_SELECT~ should be 28 (assuming SAI1 divisors
of /4 and /15); ~config_i2s~ uses ~denom = 10000~, and finds ~num =
2240~. There's actually no need for the extra zero here; I'd assumed
that these values needed to be on the order of \(1\times10^{4}\), but this
isn't the case. The quotient, ~num/denom~ would be just as valid with
values ~num = 224~ and ~denom = 1000~. Per §14.8.9-10 of the i.MX
RT1060 reference manual (v3), that the corresponding registers offer
30 bits of precision, i.e. a maximum value of:

#+begin_src python :results output :exports both
print(1 << 30)
#+end_src

#+RESULTS:
: 1073741824

i.e. enough precision to adjust ~SAI1_CLK_ROOT~ in parts per billion.

Entered on [2024-08-21 mer. 13:06]
